import ast

print('Упражнение 1. Дано число обозначающее день недели. Выяснить является номер дня недели выходным')
# Ввод и определение типа
input_value = ast.literal_eval(input('''
Введите число обозначающее день недели: 
  1 - понедельник
  2 - вторник
  3 - среда
  4 - четверг
  5 - пятница
  6 - суббота
  7 - воскресенье
'''))
if not isinstance(input_value, int):
    print(f'Извините, не могу проверить число. {input_value} не является целым числом.')
elif input_value <= 0 or input_value > 7:
    print(f'Извините, не могу проверить число. {input_value} не является днем недели.')
elif input_value > 5:
    print(f'Число {input_value} обозначает выходной день')
else:
    print(f'Число {input_value} не является обозначением для выходного дня')
