import ast

print('Упражнение 2. По двум заданным числам проверять является ли одно квадратом другого')
# Ввод и определение типа
n1 = ast.literal_eval(input('Введите первое число'))
n2 = ast.literal_eval(input('Введите второе число'))
if not isinstance(n1, int):
    print(f'Извините, не могу проверить число. {n1} не является целым числом.')
elif not isinstance(n2, int):
    print(f'Извините, не могу проверить число. {n2} не является целым числом.')
elif n1 == n2 ** 2:
    print(f'Число {n2} является квадратом числа {n1}')
else:
    print(f'Число {n2} не является квадратом числа {n1}')
