import ast

print('Упражнение 5. Задать номер четверти, показать диапазоны для возможных координат')
# Ввод и определение типа
i = ast.literal_eval(input('Введите номер четверти, число от 1 до 4: '))
if not isinstance(i, int):
    print(f'Извините, не могу проверить номер четверти. {i} не является целым числом.')
elif i < 1 or i > 4:
    print(f'Извините, не могу проверить номер четверти. {i} не является целым числом в диапазоне от 1 до 4.')
elif i == 1:
    print(f'Номер четверти: {i}, диапазон координат x > 0 и y > 0')
elif i == 2:
    print(f'Номер четверти: {i}, диапазон координат x < 0 и y > 0')
elif i == 3:
    print(f'Номер четверти: {i}, диапазон координат x < 0 и y < 0')
elif i == 4:
    print(f'Номер четверти: {i}, диапазон координат x > 0 и y < 0')