import ast

def f(x):
    if x == 0:
        return 1
    return x * f(x - 1)

print('Упражнение 6. Написать программу вычисления произведения чисел от 1 до N')
# Ввод и определение типа
n = ast.literal_eval(input('Введите число: '))
if not isinstance(n, int):
    print(f'Извините, не могу показать результат вычисления произвежения. {n} не является целым числом.')
else:
    print(f'Результат вычисления произведения чисел от 1 до N: {f(n)}')
