import ast

print('13. Выяснить, кратно ли число заданному, если нет, вывести остаток.')
value = ast.literal_eval(input('Введите заданное число: '))
n = ast.literal_eval(input('Введите второе число, которое будет проверяться на кратность: '))
if not isinstance(value, int):
    print(f'Извините, не могу выяснить, кратно ли число заданному. Заданное число {value} не является целым.')
elif not isinstance(n, int):
    print(f'Извините, не могу выяснить, кратно ли число {n} заданному {value}. Число {n} не является целым.')
elif value % n == 0:
    print(f'Число {n} является кратным заданнаму число {value}')
else:
    print(f'Число {n} не является кратным заданнаму число {value}. Остаток от деления {value % n}')