import ast

print('Написать программу вычисления значения функции y = f(a)')
